Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: It is also possible to apply manifests from a URL. So the following syntax would also be possible:
ja_jp: URL からマニフェストを適用することも可能です。したがって、以下の構文も利用できます。

source: It is also possible to associate arbitrary user data with a specific connection. The `io.quarkus.websockets.next.UserData` object obtained by the `WebSocketClientConnection#userData()` method represents mutable user data associated with a connection.
ja_jp: 任意のユーザーデータを特定の接続に関連付けることも可能です。 `WebSocketClientConnection#userData()` メソッドによって取得される `io.quarkus.websockets.next.UserData` オブジェクトは、接続に関連付けられたミュータブルなユーザーデータを表します。

source: It is also possible to associate arbitrary user data with a specific connection. The `io.quarkus.websockets.next.UserData` object obtained by the `WebSocketConnection#userData()` method represents mutable user data associated with a connection.
ja_jp: 任意のユーザーデータを特定の接続に関連付けることも可能です。 `WebSocketConnection#userData()` メソッドによって取得される `io.quarkus.websockets.next.UserData` オブジェクトは、接続に関連付けられたミュータブルなユーザーデータを表します。

source: It is also possible to block on sending the event to the emitter with the `sendAndAwait` method. It will only return from the method when the event is acked or nacked by the receiver.
ja_jp: `sendAndAwait` メソッドを使用して、イベントをエミッターに送信することをブロックすることもできます。受信者がイベントを ack または nack したときのみ、このメソッドから戻ります。

source: It is also possible to clear the cached value via `io.quarkus.arc.InjectableInstance.clearCache()`. In this case, you'll need to inject the Quarkus-specific `io.quarkus.arc.InjectableInstance` instead of `jakarta.enterprise.inject.Instance`.
ja_jp: `io.quarkus.arc.InjectableInstance.clearCache()` を使って、キャッシュされた値をクリアすることも可能です。この場合、 `jakarta.enterprise.inject.Instance` の代わりに Quarkus 固有の `io.quarkus.arc.InjectableInstance` を注入する必要があります。

source: It is also possible to clear the cached value via `io.quarkus.arc.InjectableInstance.clearCache()`. In this case, you'll need to inject the Quarkus-specific `io.quarkus.arc.InjectableInstance` instead of `javax.enterprise.inject.Instance`.
ja_jp: `io.quarkus.arc.InjectableInstance.clearCache()` を介してキャッシュされた値をクリアすることも可能です。この場合、 `javax.enterprise.inject.Instance` の代わりに Quarkus 固有の `io.quarkus.arc.InjectableInstance` を注入する必要があります。

source: It is also possible to create a generic synthetic bean `Foo<Bar>`.
ja_jp: 汎用合成 Bean `Foo<Bar> ` を作成することもできます。

source: It is also possible to create a xref:config-extending-support.adoc#custom-config-source[Custom Config Source].
ja_jp: xref:config-extending-support.adoc#custom-config-source[カスタム Config Source] を作成することもできます。

source: It is also possible to create additional profiles and activate them with the `quarkus.profile` configuration property. A single config property with the new profile name is the only requirement:
ja_jp: 追加のプロファイルを作成し、 `quarkus.profile` 設定プロパティーを使用してそれらをアクティブ化することもできます。新しいプロファイル名を持つ単一の設定プロパティーが唯一の要件です。

source: It is also possible to define a _default message template_. The default template is only used if the `Message#value()` is not specified and no relevant message template is defined in a localized file.
ja_jp: _デフォルトのメッセージテンプレート_ を定義することも可能です。 デフォルトのテンプレートは、`Message#value()` が指定されておらず、ローカライズされたファイルにも該当するメッセージテンプレートが定義されていない場合にのみ使用されます。

source: It is also possible to define multiple profile properties, with a comma-separated list of profile names. If the same property name exists in multiple profile properties then, the property name with the most specific profile wins:
ja_jp: また、プロファイル名をカンマで区切って、複数のプロファイルプロパティを定義することも可能です。同じプロパティ名が複数のプロファイルプロパティに存在する場合、最も具体的なプロファイルを持つプロパティ名が優先されます:

source: It is also possible to define role based policies, as shown in the example. These policies will only allow users with the specified roles to access the resources.
ja_jp: また、例に示すように、ロールベースのポリシーを定義することも可能です。これらのポリシーでは、指定されたロールを持つユーザーにのみ、リソースへのアクセスを許可します。

source: It is also possible to directly inject the URL into the test which can make is easy to use a different client. This is done via the `@TestHTTPResource` annotation.
ja_jp: URLをテストに直接注入することも可能で、別のクライアントを使用するのが簡単になります。 これは `@TestHTTPResource` アノテーションで行います。

source: It is also possible to enforce the required authentication level for an OIDC tenant:
ja_jp: OIDC テナントに必要な認証レベルを適用することも可能です:

source: It is also possible to exclude a dependency artifact that would be otherwise scanned for beans. For example, because it contains a `beans.xml` descriptor.
ja_jp: また、除外しなければ Bean をスキャンする、依存関係のあるアーティファクトを除外することも可能です。たとえば、 `beans.xml` 記述子を含んでいる場合です。

source: It is also possible to generate a public and private key pair by using the OpenSSL command line tool.
ja_jp: OpenSSL コマンドラインツールを使用して公開鍵と秘密鍵のペアを生成することもできます。

source: It is also possible to generate a public and private key pair using the OpenSSL command line tool.
ja_jp: OpenSSL コマンドラインツールを使用して、公開鍵と秘密鍵のペアを生成することもできます。

source: It is also possible to leverage the Quartz API directly. You can inject the underlying `org.quartz.Scheduler` in any bean:
ja_jp: Quartz APIを直接利用することも可能です。どのBeanにも、基礎となる `org.quartz.Scheduler` を注入することができます。

source: It is also possible to list all open connections. Quarkus provides a CDI bean of type `io.quarkus.websockets.next.OpenClientConnections` that declares convenient methods to access the connections.
ja_jp: 開いているすべての接続をリスト表示することもできます。 Quarkus は、接続にアクセスするための便利なメソッドを宣言する `io.quarkus.websockets.next.OpenClientConnections` タイプの CDI Bean を提供します。

source: It is also possible to list all open connections. Quarkus provides a CDI bean of type `io.quarkus.websockets.next.OpenConnections` that declares convenient methods to access the connections.
ja_jp: 開いているすべての接続をリスト表示することもできます。 Quarkus は、接続にアクセスするための便利なメソッドを宣言する `io.quarkus.websockets.next.OpenConnections` タイプの CDI Bean を提供します。

source: It is also possible to map certificate attributes to roles. Let's consider the example explained in the <<map-certificate-attributes-to-roles>> section:
ja_jp: 証明書属性をロールにマッピングすることも可能です。<<map-certificate-attributes-to-roles>> セクションで説明されている例を考えてみましょう。

source: It is also possible to obtain a localized message for a key resolved at runtime using a reserved key `message`. The validation is skipped in this case though.
ja_jp: また、予約されたキー `message` を使用して、実行時に解決されたキーのローカライズされたメッセージを取得することも可能である。この場合、検証はスキップされます。

source: It is also possible to obtain the list of all bean instance handles programmatically via the `Arc.container().listAll()` methods.
ja_jp: `Arc.container().listAll()` メソッドを使用して、プログラムですべての Bean インスタンスハンドルのリストを取得することもできます。

source: It is also possible to pass configuration properties to the provider using standard MicroProfile Config injection:
ja_jp: 標準的なMicroProfile Configインジェクションを使用して、設定プロパティーをプロバイダに渡すことも可能です。

source: It is also possible to re-run the tests against a native executable that has already been built. To do this run `./mvnw test-compile failsafe:integration-test -Dnative`. This will discover the existing native image and run the tests against it using failsafe.
ja_jp: すでにビルドされているネイティブ実行可能ファイルに対してテストを再実行することも可能です。 その場合は `./mvnw test-compile failsafe:integration-test` を実行します。これにより、既存のネイティブイメージが検出され、フェイルセーフを使用してそれに対してテストが実行されます。

source: It is also possible to re-run the tests against a native executable that has already been built. To do this run `./mvnw test-compile failsafe:integration-test -Pnative`. This will discover the existing native image and run the tests against it using failsafe.
ja_jp: すでにビルドされているネイティブ実行可能ファイルに対してテストを再実行することも可能です。これを行うには `./mvnw test-compile failsafe:integration-test` を実行してください。これにより、既存のネイティブイメージが検出され、フェイルセーフを使用してそれに対してテストが実行されます。

source: It is also possible to re-run the tests against a native executable that has already been built. To do this run `./mvnw test-compile failsafe:integration-test`. This will discover the existing native image and run the tests against it using failsafe.
ja_jp: すでにビルドされているネイティブ実行可能ファイルに対してテストを再実行することも可能です。これを行うには `./mvnw test-compile failsafe:integration-test` を実行してください。これにより、既存のネイティブイメージが検出され、フェイルセーフを使用してそれに対してテストが実行されます。

source: It is also possible to run security checks on every message. For example, a message payload can be accessed like this:
ja_jp: すべてのメッセージに対してセキュリティーチェックを実行することもできます。たとえば、メッセージペイロードには次のようにアクセスできます。

source: It is also possible to set a description that will appear in the help output.
ja_jp: ヘルプ出力に表示される説明を設定することもできます。

source: It is also possible to set configuration properties for a test method with the `@io.quarkus.test.component.TestConfigProperty` annotation. However, if the test instance lifecycle is `Lifecycle#_PER_CLASS` this annotation can only be used on the test class and is ignored on test methods.
ja_jp: `@io.quarkus.test.component.TestConfigProperty` アノテーションを使用して、テストメソッドの設定プロパティーを設定することもできます。 ただし、テストインスタンスのライフサイクルが `Lifecycle#_PER_CLASS` の場合、このアノテーションはテストクラスでのみ使用でき、テストメソッドでは無視されます。

source: It is also possible to set custom permissions like in the example below:
ja_jp: 以下の例のようにカスタム権限を設定することもできます。

source: It is also possible to set the `quarkus.websockets-next.server.activate-request-context` config property to `always`. In this case, the request context is always activated when an endpoint callback is invoked.
ja_jp: `quarkus.websockets-next.server.activate-request-context` 設定プロパティーを `always` に設定することもできます。この場合、エンドポイントコールバックが呼び出されると、リクエストコンテキストが常にアクティブ化されます。

source: It is also possible to set the `quarkus.websockets-next.server.activate-session-context` config property to `always`. In this case, the session context is always activated, no matter if a `@SessionScoped` bean participates in the dependency tree.
ja_jp: `quarkus.websockets-next.server.activate-session-context` 設定プロパティーを `always` に設定することもできます。この場合、 `@SessionScoped` Bean が依存関係ツリーに参加しているかどうかに関係なく、セッションコンテキストは常にアクティブ化されます。

source: It is also possible to set the default scope via `AdditionalBeanBuildItem.Builder#setDefaultScope()`. The default scope is only used if there is no scope declared on the bean class.
ja_jp: `AdditionalBeanBuildItem.Builder#setDefaultScope()` を介してデフォルトスコープを設定することも可能です。デフォルトスコープは、Bean クラスにスコープが宣言されていない場合にのみ使用されます。

source: It is also possible to specify a HQL query with a select clause. In this case, the projection class must have a constructor matching the values returned by the select clause:
ja_jp: また、select句でHQLクエリを指定できます。この場合、射影クラスは、select句が返す値に一致するコンストラクタを持つ必要があります。

source: It is also possible to specify the contents for a type-safe template directly in your Java code. A `static native` method of a class annotated with `@CheckedTemplate` or a Java record that implements `TemplateInstance` may be annotated with `@io.quarkus.qute.TemplateContents`. The annotation value is used as the template contents. The template id/path is derived from the type-safe template.
ja_jp: 型セーフテンプレートの内容を Java コード内で直接指定することもできます。 `@CheckedTemplate` でアノテーションが付けられたクラスの `static native` メソッド、または `TemplateInstance` を実装する Java レコードには、`@io.quarkus.qute.TemplateContents` でアノテーションが付けられる場合があります。 アノテーション値はテンプレートの内容として使用されます。 テンプレート ID/パスは、タイプセーフテンプレートから派生されます。

source: It is also possible to specify the default scope. The default scope is only used if there is no scope declared on the bean class.
ja_jp: デフォルトスコープを設定することもできます。デフォルトスコープは、Bean クラスにスコープが宣言されていない場合にのみ使用されます。

source: It is also possible to subscribe to a supplied `io.smallrye.mutiny.Multi` on a Vert.x duplicated context. In this case, the current thread is not blocked and the supplied subscription logic is used to consume the events.
ja_jp: また、Vert.xの複製されたコンテキストで、提供された `io.smallrye.mutiny.Multi` を購読することも可能です。 この場合、現在のスレッドはブロックされず、提供されたサブスクリプションロジックがイベントを消費するために使用されます。

source: It is also possible to test native executables using `@NativeImageTest`. This supports all the features mentioned in this guide except injecting into tests (and the native executable runs in a separate non-JVM process this is not really possible).
ja_jp: `@NativeImageTest` を使用してネイティブ実行可能ファイルをテストすることも可能です。これは、テストに注入すること(そして、ネイティブ実行可能ファイルは別の非JVMプロセスで実行されることーこれは実際には可能ではありません)を除いて、このガイドで述べたすべての機能をサポートしています。

source: It is also possible to test native executables using `@QuarkusIntegrationTest`. This supports all the features mentioned in this guide except injecting into tests (and the native executable runs in a separate non-JVM process this is not really possible).
ja_jp: `@QuarkusIntegrationTest` を使用してネイティブ実行可能ファイルをテストすることも可能です。これは、テストに注入すること (そして、ネイティブ実行可能ファイルは別の非 JVM プロセスで実行されることーこれは実際には可能ではありません) を除いて、このガイドで述べたすべての機能をサポートしています。

source: It is also possible to use `@IfBuildProfile` and `@UnlessBuildProfile` on stereotypes.
ja_jp: ステレオタイプで `@IfBuildProfile` と `@UnlessBuildProfile` を使用することもできます。

source: It is also possible to use `@IfBuildProperty` and `@UnlessBuildProperty` on stereotypes.
ja_jp: ステレオタイプで `@IfBuildProperty` と `@UnlessBuildProperty` を使用することもできます。

source: It is also possible to use escape sequences `\{` and `\}` to insert delimiters in the text. In fact, an escape sequence is usually only needed for the start delimiter, i.e. `\\{foo}` will be rendered as `{foo}` (no parsing/evaluation will happen).
ja_jp: エスケープシーケンス `\{` and `\}` を使ってテキストにデリミタを挿入することも可能です。 実際には、エスケープシーケンスは通常、開始デリミタのためにのみ必要とされます。すなわち、`\\{foo}` は `{foo}` として描画されます（パース、評価は行われません）。

source: It is also possible to use escape sequences `\{` and `\}` to insert delimiters in the text. In fact, an escape sequence is usually only needed for the start delimiter, ie. `\\{foo}` will be rendered as `{foo}` (no parsing/evaluation will happen).
ja_jp: エスケープシーケンス `\{` や `\}` を使ってテキストにデリミタを挿入することも可能です。 実際には、エスケープシーケンスは通常、開始デリミタのためにのみ必要とされます。すなわち、 `\\{foo}`は `{foo}` として描画されます（パース、評価は行われません）。

source: It is also possible to use the `BeanRegistrationPhaseBuildItem` to register a synthetic bean. However, we recommend extension authors to stick with `SyntheticBeanBuildItem` which is more idiomatic for Quarkus.
ja_jp: `BeanRegistrationPhaseBuildItem` を使用して合成 Bean を登録することもできます。ただし、エクステンション作成者においては、Quarkus にとってより慣用的な `SyntheticBeanBuildItem` を使用することをお勧めします。

source: It is also possible to use the `io.quarkus.vertx.http.runtime.security.annotation.HttpAuthenticationMechanism` annotation to select any authentication mechanism based on its scheme. Annotation-based analogy to the `quarkus.http.auth.permission.basic.auth-mechanism=custom` configuration property is the `@HttpAuthenticationMechanism("custom")` annotation.
ja_jp: また、 `io.quarkus.vertx.http.runtime.security.annotation.HttpAuthenticationMechanism` アノテーションを使用して、そのスキームに基づいて任意の認証メカニズムを選択することも可能です。 `quarkus.http.auth.permission.basic.auth-mechanism=custom` 設定プロパティーに類似するアノテーションとして、 `@HttpAuthenticationMechanism("custom")` アノテーションがあります。

source: It is also possible to write tests that verify an extension works correctly in development mode and can correctly handle updates.
ja_jp: 開発モードでエクステンションが正しく動作し、アップデートを正しく処理できるかどうかを検証するテストを書くことも可能です。

source: It is also recommended to run the integration tests against Keycloak by using Dev Services for Keycloak. For more information, see xref:security-oidc-bearer-token-authentication.adoc#bearer-token-integration-testing-keycloak-devservices[Testing OpenID Connect Service Applications with Dev Services] and xref:security-oidc-code-flow-authentication.adoc#code-flow-integration-testing-keycloak-devservices[Testing OpenID Connect WebApp Applications with Dev Services].
ja_jp: また、Dev Services for Keycloak を使用して、Keycloak に対して結合テストを実行することを推奨します。 詳細は、xref:security-oidc-bearer-token-authentication.adoc#integration-testing-keycloak-devservices[Dev Services を使用した OpenID Connect サービスアプリケーションのテスト] および xref:security-oidc-code-flow-authentication.adoc#integration-testing-keycloak-devservices[Dev Services を使用した OpenID Connect WebApp アプリケーションのテスト] を参照してください。

source: It is also recommended to run the integration tests against Keycloak using `Dev Services for Keycloak`. Please see xref:security-openid-connect.adoc#integration-testing-keycloak-devservices[Testing OpenID Connect Service Applications with Dev Services] and xref:security-openid-connect-web-authentication.adoc#integration-testing-keycloak-devservices[Testing OpenID Connect WebApp Applications with Dev Services] for more information.
ja_jp: また、 `Dev Services for Keycloak` を使用して、Keycloak に対して統合テストを実行することをお勧めします。詳細は、xref:security-openid-connect.adoc#integration-testing-keycloak-devservices[Dev Services を使用した OpenID Connect サービスアプリケーションのテスト] および xref:security-openid-connect-web-authentication.adoc#integration-testing-keycloak-devservices[Dev Services を使用した OpenID Connect WebApp アプリケーションのテスト] を参照してください。

source: It is also recommended to use _tiered compilation_ when using SnapStart. To achieve this, set the `JAVA_TOOL_OPTIONS` environment property to `-XX:+TieredCompilation -XX:TieredStopAtLevel=1`.
ja_jp: また、SnapStartを使用する場合は、 _階層型コンパイル_ を使用することをお勧めします。これを実現するには、 `JAVA_TOOL_OPTIONS` 環境プロパティを `-XX:+TieredCompilation -XX:TieredStopAtLevel=1` に設定します。

source: It is also supported to attach a given model class to several persistence units.
ja_jp: モデルクラスを複数の永続化ユニットにアタッチすることもサポートされます。

source: It is also worth noticing that a lot of work is invested in improving the performances of Quarkus lately and you should see significant performance boosts from release to release in the next few months.
ja_jp: また、最近Quarkusのパフォーマンス向上に多くの労力が費やされており、今後数ヶ月の間にリリースごとに大幅なパフォーマンス向上が見られるはずです。

source: It is an array so you can register several cache implementations in one go if your configuration requires several of them.
ja_jp: 配列なので、複数のキャッシュ実装が必要な構成の場合、一度に登録することができます。

source: It is an array, so you can register several cache implementations in one go if your configuration requires several of them.
ja_jp: 配列なので、複数のキャッシュ実装が必要な構成の場合、一度に登録することができます。

source: It is an easy task, we just need to create an implementation of `ElasticsearchAnalysisConfigurer` (and configure Quarkus to use it, more on that later).
ja_jp: これは簡単な作業で、 `ElasticsearchAnalysisConfigurer` の実装を作成するだけです（そして、それを使用するようにQuarkusを設定します、詳細は後述します）。

source: It is aso possible to set the default scope via `AdditionalBeanBuildItem.Builder#setDefaultScope()`. The default scope is only used if there is no scope declared on the bean class.
ja_jp: `AdditionalBeanBuildItem.Builder#setDefaultScope()` からデフォルトのスコープを設定することも可能です。デフォルトのスコープは、Beanクラスにスコープが宣言されていない場合にのみ使用されます。

source: It is built on top of the xref:mongodb.adoc[MongoDB Client] extension.
ja_jp: これは、 link:mongodb.html[MongoDB Client]エクステンションの上に構築されています。

source: It is common to make the bindings source class and methods `abstract` so that you don't have to write method bodies:
ja_jp: メソッド本体を記述しなくて済むように、バインディングソースクラスとメソッドを `abstract` にするのが一般的です。

source: It is complemented by a dedicated https://github.com/quarkusio/quarkus/wiki/Migration-Guide-3.0:-Hibernate-ORM-5-to-6-migration[Hibernate ORM 6.2 update guide].
ja_jp: https://github.com/quarkusio/quarkus/wiki/Migration-Guide-3.0:-Hibernate-ORM-5-to-6-migration[Hibernate ORM 6.2アップデート専門ガイド] が補完しています。

source: It is composed of build steps (methods annotated with `@BuildStep`).
ja_jp: ビルドステップ（ `@BuildStep` でアノテーションされたメソッド）で構成されています。

source: It is due to the fact that Quarkus OIDC is `stateless` by default. It encrypts the user session details in the session cookie and no user session related content is stored on the server. This approach offers significantly higher WEB-scale level capabilities.
ja_jp: これは、Quarkus OIDC がデフォルトで `stateless` (ステートレス) であるためです。ユーザーセッションの詳細をセッションクッキー内で暗号化し、ユーザーセッションに関連するコンテンツはサーバーに保存されません。このアプローチにより、大幅に高い WEB スケールレベルの機能が提供されます。

source: It is easy to support it with Quarkus OIDC. You must configure an Auth0 end session endpoint URL and have Quarkus include both the `client-id` query parameter and the post logout URL as the `returnTo` query parameter in the RP-initated logout redirect request to Auth0:
ja_jp: Quarkus OIDC を使用するとこれを簡単にサポートできます。Auth0 のセッション終了エンドポイント URL を設定し、Quarkus で、 `client-id` クエリーパラメーターとログアウト後の URL の両方を、 `returnTo` クエリーパラメーターとしてAuth0 への RRP-initated logoutリダイレクトリクエストに含める必要があります。

source: It is essential that all the logic the span is measuring be well delimited by a scope. The scope is Autocloseable.
ja_jp: スパンが測定するすべてのロジックが、スコープによって明確に区切られていることが不可欠です。そのスコープは Autocloseable です。

source: It is essential to understand that these issues are not Quarkus limitations or bugs but are due to the current state of the Java ecosystem which needs to evolve to become virtual thread friendly.
ja_jp: これらの問題は、Quarkusの制限やバグではなく、仮想スレッドフレンドリーに進化する必要があるJavaエコシステムの現状によるものであることを理解することが重要です。

source: It is generally not recommended using the same entity object between the REST API and the data access layer. These layers should indeed be decoupled and use distinct APIs in order to allow each API to evolve independently of the other. This is the reason why our REST API is using a different object: the `FruitDto` class – the word DTO stands for "Data Transfer Object". This DTO object will be automatically converted to and from JSON in HTTP messages:
ja_jp: 通常、REST API とデータアクセス層の間で同じエンティティーオブジェクトを使用することはお勧めしません。各 API を互いに独立して進化させるには、これらのレイヤーを実際に分離し、個別の API を使用する必要があります。このように、異なるオブジェクトを ( `FruitDto` ) を使用する理由です。DTO という用語は、「Data Transfer Object」の略です。この DTO オブジェクトは、HTTP メッセージで JSON に対する変換を自動的に行います。

source: It is going to be merged with the other codestarts config and automatically converted to the selected config type (yaml or properties).
ja_jp: これは、他の Codestart のコンフィグとマージされ、選択された設定タイプ (yaml または properties) に自動的に変換されます。

source: It is going to be:
ja_jp: 次のようになります:

source: It is highly discouraged to use the manifests generated by the Minikube extension when deploying to production as these manifests are intended for development purposes only. When deploying to production, consider using the vanilla Kubernetes manifests (or the OpenShift ones when targeting OpenShift).
ja_jp: 本番環境へのデプロイ時に Minikube エクステンションで生成されたマニフェストを使用することはまったくお勧めできません。本番環境にデプロイする場合は、バニラ Kubernetes マニフェスト (または OpenShift をターゲットにしている場合は OpenShift マニフェスト) の使用を検討してください。

source: It is highly recommended to align the Mandrel version used in integration testing with the Mandrel version used to build native executables. Doing in-container native builds with the default Mandrel builder image, is the safest way to keep both versions aligned.
ja_jp: ネイティブ実行可能ファイルの構築に使用される Mandrel バージョンと、結合テストで使用する Mandrel のバージョンを合わせることを強く推奨します。 最も安全に両方のバージョンを一致させるには、デフォルトの Mandrel ビルダーイメージを使って、コンテナー内でネイティブビルドを実行する方法があります。

source: It is however possible to enable single-node transactions by setting `quarkus.redis.cluster-transactions` to `single-node`. Note that this setting only makes sense in the cluster mode and is ignored otherwise.
ja_jp: ただし、 `quarkus.redis.cluster-transactions` を `single-node` に設定することで、単一ノードのトランザクションを有効にすることが可能です。この設定はクラスターモードでのみ意味を持ち、それ以外の場合は無視されることに注意してください。

source: It is however possible to use a custom configuration profile for your tests with the Gradle build configuration shown below. This can be useful if you need for example to run some tests using a specific database which is not your default testing database.
ja_jp: しかし、以下に示す Gradle ビルド設定でテスト用のカスタム設定プロファイルを使用することは可能です。これは例えば、デフォルトのテストデータベースではない特定のデータベースを使ってテストを実行する必要がある場合に便利です。

source: It is however possible to use a custom configuration profile for your tests with the Maven Surefire and Maven Failsafe configurations shown below. This can be useful if you need for example to run some tests using a specific database which is not your default testing database.
ja_jp: ただし、以下に示すMaven SurefireおよびMaven Failsafe構成で、テストにカスタム設定プロファイルを使用することは可能です。これは、例えば、デフォルトのテストデータベースではない特定のデータベースを使用してテストを実行する必要がある場合に便利です。
